In [4]:
#creating series
import pandas as pd
car_price = pd.Series(['$2000', '$2300', '$4000', '$2000','$18000'])
car_make =pd.Series(['Toyota', 'Mitsuibush', 'Datsun', 'Lexus', 'Toyota'])

In [20]:
#creating dataframe 
car_data = pd.DataFrame({
    'car_make': car_make,
    'car-price': car_price
})

In [21]:
car_data

     car_make car-price
0      Toyota     $2000
1  Mitsuibush     $2300
2      Datsun     $4000
3       Lexus     $2000
4      Toyota    $18000

In [23]:
car_data['seat_number'] = [2,4,4,7,4]

In [24]:
car_data

     car_make car-price  seat_number
0      Toyota     $2000            2
1  Mitsuibush     $2300            4
2      Datsun     $4000            4
3       Lexus     $2000            7
4      Toyota    $18000            4

In [25]:
car_data['horse_power'] = [114, 230, 345, 120, 110]

In [26]:
car_data

     car_make car-price  seat_number  horse_power
0      Toyota     $2000            2          114
1  Mitsuibush     $2300            4          230
2      Datsun     $4000            4          345
3       Lexus     $2000            7          120
4      Toyota    $18000            4          110